tap "anomalyco/tap"
tap "atlassian/acli"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "supersonic-app/supersonic"
# Official Amazon AWS command-line interface
brew "awscli"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Statically typed language for the Erlang VM
brew "gleam"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Lazier way to manage everything docker
brew "lazydocker"
# Implementation of the file(1) command
brew "libmagic"
# XML security library
brew "libxmlsec1"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@8.0", link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Data loading tool for PostgreSQL
brew "pgloader"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Steel Bank Common Lisp system
brew "sbcl"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Menu bar app for monitoring AI coding assistant usage quotas
cask "claudebar"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Visual diff and merge tool
cask "meld"
# Netbird UI Client
cask "netbirdio/tap/netbird-ui"
# Convert HTML to PDF
cask "prince"
# A lightweight and full-featured cross-platform desktop client for self-hosted music servers
cask "supersonic-app/supersonic/supersonic"
# Menu bar customization tool
cask "swiftbar"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
cargo "tauri-cli"
cargo "tmux-sessionizer"
npm "corepack"
npm "node-gyp"
